console.log("Score: 85/125");
console.log(
  "1. Слайдер изображений в секции destinations 10/50. Пока слайдер реализован только на мобильной версии, и переключаются слайды только по стрелкам"
);
console.log(
  "2. Нажатие на кнопку Login (кнопка Account в мобильной версии) показывает сверстанный логин попап + 50"
);
console.log(
  "3. Нажатие на кнопку Register на Login попапе меняет разметку попапа на разметку Sign Up попапа согласно макету (То есть нажатие не закрывает модал а просто меняет его наполнение) +25"
);
